export const quizData = [
    {
        id:1,
        title:'Что такое операционная система?',
        answers:[
            {
                text:'Это просто программа на компьютере, как и другие - Word или Chrome',
                result:false
            },
            {
                text:'Это показатель того, какой процессор используется на компьютере. Например, 32-битный или 64-битный',
                result:false,
            },
            {
                text:'Это набор взаимосвязанных программ, осуществляющих управление компьютером и взаимодействие с пользователем',
                result:true
            },
            {
                text:'Нет такого понятия, есть понятие "файловая система"',
                result:false
            }
        ]
    },
    {
        id:2,
        title:'Является ли Android операционной системой?',
        answers:[
            {
                text:'Да, это такая же ОС, как и другие, просто для мобильных девайсов',
                result:true
            },
            {
                text:'Нет, операционные системы бывают только для ПК',
                result:false,
            },
            {
                text:'Нет, Android это программа, которая ставится на операционную систему девайса. ОС на разных девайсах разные',
                result:false
            },
            {
                text:'Это домашняя страничка в настройках вашего браузера',
                result:false
            }
        ]
    },
    {
        id:3,
        title:'Что такое процессор компьютера?',
        answers:[
            {
                text:'Это блок, внутри которого находится дисковод и много разъемов для монитора, клавиатуры и компьютерной мышки',
                result:false
            },
            {
                text:'Это общее название всех комплектующих компьютера',
                result:false,
            },
            {
                text:'Это элемент компьютера, с помощью которого обрабатывается информация, находящаяся как в собственной памяти, так и в памяти других устройств',
                result:true
            },
            {
                text:'Это суммарный показатель вычислительной мощности компьютера, например 2,7 ГГц',
                result:false
            }
        ]
    },
    {
        id:4,
        title:'Какие бывают разрядности у современных процессоров?',
        answers:[
            {
                text:'32 и 64 бита',
                result:true
            },
            {
                text:'12 и 32 бита',
                result:false,
            },
            {
                text:'15 и 32 бита',
                result:false
            },
            {
                text:'86 и 64 бита',
                result:false
            }
        ]
    },
    {
        id:5,
        title:'Какой тип процессора чаще всего используют мобильные девайсы?',
        answers:[
            {
                text:'iOS использует Intel, остальные используют AMD',
                result:false
            },
            {
                text:'Чаще всего используют Intel',
                result:false,
            },
            {
                text:'Чаще всего используют AMD',
                result:false
            },
            {
                text:'Чаще всего используют ARM',
                result:true
            }
        ]
    },
    {
        id:6,
        title:'Для чего компьютеру нужна RAM?',
        answers:[
            {
                text:'Для быстрого доступа к данным',
                result:true
            },
            {
                text:'Для долгосрочного хранения данных',
                result:false,
            },
            {
                text:'Для правильной фрагментации памяти',
                result:false
            },
            {
                text:'Для дефрагментации данных',
                result:false
            }
        ]
    },
    {
        id:7,
        title:'Чем отличается HDD от SSD?',
        answers:[
            {
                text:'HDD - это твердотельный накопитель без подвижных частей. Более дешевый, чем SSD. HDD работает быстрее',
                result:false
            },
            {
                text:'HDD - это твердотельный накопитель без подвижных частей. Более дорогой, чем SSD. HDD работает быстрее',
                result:false,
            },
            {
                text:'SSD - это твердотельный накопитель без подвижных частей. Более дешевый, чем HDD. SSD работает быстрее',
                result:false
            },
            {
                text:'SSD - это твердотельный накопитель без подвижных частей. Более дорогой, чем HDD. SSD работает быстрее',
                result:true
            }
        ]
    },
    {
        id:8,
        title:'Как отличаются между собой USB?',
        answers:[
            {
                text:'Бывают только USB 2.0 и 3.2',
                result:false
            },
            {
                text:'Бывают только micro-USB и mini-USB',
                result:false,
            },
            {
                text:'USB отличаются по пропускной способности (micro-USB, mini-USB, lightning и т.д.) и форме (USB 2.0, USB 3.2)',
                result:false
            },
            {
                text:'USB отличаются по форме (micro-USB, mini-USB, lightning и т.д.) и пропускной способности (USB 2.0, USB 3.2)',
                result:true
            }
        ]
    },
    {
        id:9,
        title:'Какой файловой системы не существует?',
        answers:[
            {
                text:'Fat',
                result:false
            },
            {
                text:'NTFS',
                result:false,
            },
            {
                text:'APFS',
                result:false
            },
            {
                text:'BolSFS',
                result:true
            }
        ]
    },
]